[
  {
    "date": "Diplôme",
    "image": "/img/diplôme.png",
    "title": "Concepteur Développeur d'Applications",
    "description": "J'ai réalisé et documenté un projet présenté lors d'une soutenance pour l'obtention de mon diplôme de Concepteur Développeur d'Applications.",
    "technologies": []
  },
  {
    "date": "11/2023 - 12/2024",
    "image": "/img/dpp.png",
    "title": "M6 Digital Services - Digital Prisma Player",
    "description": "Après la fermeture du pôle informatique du Groupe Cerise et la reprise des projets par Digital Prisma Player, j'ai poursuivi mes tâches tout en découvrant de nouveaux projets et infrastructures.",
    "technologies": [
      1,
      2,
      4,
      6,
      7,
      5,
      9,
      10,
      11
    ]
  },
  {
    "date": "Projet",
    "image": "/img/articleSourcing.png",
    "title": "Article Sourcing",
    "description": "Pour l'entreprise Digital Prisma Player, j'ai développé une application Web avec Nest.js et React. Elle permettait de récupérer des données via des flux RSS et de générer des articles grâce à une IA générative. Cette application avait pour objectif d'augmenter la productivité des rédacteurs de l'entreprise. J'ai présenté ce projet lors d'une soutenance, qui m'a permis d'obtenir mon diplôme de Concepteur Développeur d'Applications.",
    "link": "",
    "technologies": [
      1,
      2,
      4,
      6,
      7,
      9,
      10
    ]
  },
  {
    "date": "Diplôme",
    "image": "/img/diplôme.png",
    "title": "Développeur Web et Web Mobile",
    "description": "J'ai réalisé et documenté un projet présenté lors d'une soutenance pour l'obtention d'un diplôme demon diplôme de Développeur Web et Web Mobile.",
    "technologies": []
  },
  {
    "date": "02/2022 - 11/2023",
    "image": "/img/cerise.png",
    "title": "Groupe Cerise",
    "description": "Mes débuts en tant que Développeur m'ont permis de découvrir et d'appréhender ce métier. J'ai assuré la maintenance et le développement de fonctionnalités pour les sites et webservices de l'entreprise, mené des études techniques et documenté les projets pour orienter les développements futurs. Le tout s'est déroulé dans un cadre Scrum, avec une stack technique principalement en PHP (sites principaux), MongoDB, GoogleTagManager, ainsi que des projets en Angular et Node.js avec Webpack. Nous utilisions également des outils comme GitLab, Harbord, Verdaccio et Docker. Cette expérience enrichissante a renforcé mes compétences et confirmé ma passion pour ce métier.",
    "technologies": [
      1,
      2,
      3,
      5,
      8,
      9,
      10,
      11
    ]
  },
  {
    "date": "Projet",
    "image": "/img/shoesRar.png",
    "title": "Shoes.Rar",
    "description": "Un site e-commerce développé avec Symfony, documenté et présenté lors d'une soutenance pour obtenir mon diplôme de Développeur Web et Web Mobile.",
    "link": "https://github.com/Aminebneji/Shoes.RAR",
    "technologies": [
      3,
      4
    ]
  },
  {
    "date": "10/2022 - 02/2022",
    "image": "/img/wf3.png",
    "title": "WebForce 3",
    "description": "Une formation axée sur les bases de la programmation et sur des technologies telles que PHP, Symfony et Angular. Un accent particulier était mis sur le développement Front-End. J'ai suivi cette formation en alternance.",
    "technologies": []
  },
  {
    "date": "Projet",
    "image": "/img/filRougeAston.png",
    "title": "Gamin' Home",
    "description": "Une application Web construite avec Angular et C# .NET, représentant le site d'un cybercafé imaginaire.",
    "link": "https://github.com/Aminebneji/cyber_april",
    "technologies": [
      1,
      2,
      12,
      8,
      9
    ]
  },
  {
    "date": "01/2022 - 04/2022",
    "image": "/img/Aston.png",
    "title": "Aston École",
    "description": "La deuxième partie d'une préparation opérationnelle à l'emploi. J'y ai découvert la programmation orientée objet avec C# et le framework .NET, la manipulation de données, la création de bases de données et la gestion des environnements de production.",
    "technologies": []
  },
  {
    "date": "11/2021 - 01/2022",
    "image": "/img/simplon.png",
    "title": "Simplon",
    "description": "La première partie d'une formation 'Invest in Digital People' de Pôle Emploi. Réalisée en collaboration avec Aston École, cette préparation opérationnelle à l'emploi m'a permis de découvrir les bases de la programmation, les frameworks, les algorithmes et Git.",
    "technologies": []
  },
  {
    "date": "Projet",
    "image": "/img/JDRsimplon.jpg",
    "title": "JdR Simplon",
    "description": "Une application Web développée en HTML, CSS et JavaScript natif, permettant à l'utilisateur de décider de l'évolution d'une histoire en choisissant parmi plusieurs options à chaque événement.",
    "link": "https://github.com/Aminebneji/jdr-simplon",
    "technologies": [
      1,
      2,
      9
    ]
  },
  {
    "date": "04/2022 - 10/2022",
    "image": "/img/sticker-hein.png",
    "title": "Commis de Cuisine",
    "description": "Commis de cuisine dans le restaurant de Brique House : le HEIN.",
    "technologies": []
  },
  {
    "date": "08/2021 - 11/2021",
    "image": "/img/BriqueHouse.png",
    "title": "Runner polyvalent",
    "description": "Runner polyvalent dans une taproom de Brique House à Saint-André-lez-Lille.",
    "technologies": []
  }
]
